k6/results/read-10m-run2.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/read.js
        output: -

     scenarios: (100.00%) 2 scenarios, 4000 max VUs, 1m0s max duration (incl. graceful stop):
              * rank: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: rank, gracefulStop: 30s)
              * top: 5000.00 iterations/s for 30s (maxVUs: 300-2000, exec: top, gracefulStop: 30s)

time="2026-09-16T16:21:07Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:3000/leaderboard/rank/p008024951?n=5\": dial tcp 192.168.65.254:3000: connect: connection refused"
time="2026-09-16T16:21:07Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:3000/leaderboard/rank/p000352683?n=5\": dial tcp 192.168.65.254:3000: connect: connection refused"
time="2026-09-16T16:21:07Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:3000/leaderboard/top?limit=100\": dial tcp 192.168.65.254:3000: connect: connection refused"
time="2026-09-16T16:21:07Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:3000/leaderboard/top?limit=100\": dial tcp 192.168.65.254:3000: connect: connection refused"
time="2026-09-16T16:21:07Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:3000/leaderboard/rank/p007794427?n=5\": dial tcp 192.168.65.254:3000: connect: connection refused"
time="2026-09-16T16:21:07Z" level=warning msg="Request Failed" error="Get \"http://host.docker.internal:3000/leaderboard/top?limit=100\": dial tcp 192.168.65.254:3000: connect: connection refused"

running (0m01.0s), 1231/1304 VUs, 4507 complete and 0 interrupted iterations
rank   [   3% ] 0611/0639 VUs  01.0s/30s  5000.00 iters/s
top    [   3% ] 0620/0665 VUs  01.0s/30s  5000.00 iters/s

running (0m02.0s), 0037/1321 VUs, 15593 complete and 0 interrupted iterations
rank   [   7% ] 0021/0651 VUs  02.0s/30s  5000.00 iters/s
top    [   7% ] 0017/0670 VUs  02.0s/30s  5000.00 iters/s

running (0m03.0s), 0018/1321 VUs, 25611 complete and 0 interrupted iterations
rank   [  10% ] 0009/0651 VUs  03.0s/30s  5000.00 iters/s
top    [  10% ] 0009/0670 VUs  03.0s/30s  5000.00 iters/s

running (0m04.0s), 0034/1321 VUs, 35595 complete and 0 interrupted iterations
rank   [  13% ] 0017/0651 VUs  04.0s/30s  5000.00 iters/s
top    [  13% ] 0017/0670 VUs  04.0s/30s  5000.00 iters/s

running (0m05.0s), 0028/1321 VUs, 45601 complete and 0 interrupted iterations
rank   [  17% ] 0015/0651 VUs  05.0s/30s  5000.00 iters/s
top    [  17% ] 0015/0670 VUs  05.0s/30s  5000.00 iters/s

running (0m06.0s), 0026/1321 VUs, 55596 complete and 0 interrupted iterations
rank   [  20% ] 0013/0651 VUs  06.0s/30s  5000.00 iters/s
top    [  20% ] 0017/0670 VUs  06.0s/30s  5000.00 iters/s

running (0m07.0s), 0013/1321 VUs, 65611 complete and 0 interrupted iterations
rank   [  23% ] 0004/0651 VUs  07.0s/30s  5000.00 iters/s
top    [  23% ] 0009/0670 VUs  07.0s/30s  5000.00 iters/s

running (0m08.0s), 0026/1321 VUs, 75603 complete and 0 interrupted iterations
rank   [  27% ] 0011/0651 VUs  08.0s/30s  5000.00 iters/s
top    [  27% ] 0015/0670 VUs  08.0s/30s  5000.00 iters/s

running (0m09.0s), 0027/1321 VUs, 85602 complete and 0 interrupted iterations
rank   [  30% ] 0011/0651 VUs  09.0s/30s  5000.00 iters/s
top    [  30% ] 0017/0670 VUs  09.0s/30s  5000.00 iters/s

running (0m10.0s), 0021/1321 VUs, 95608 complete and 0 interrupted iterations
rank   [  33% ] 0011/0651 VUs  10.0s/30s  5000.00 iters/s
top    [  33% ] 0010/0670 VUs  10.0s/30s  5000.00 iters/s

running (0m11.0s), 0024/1321 VUs, 105602 complete and 0 interrupted iterations
rank   [  37% ] 0017/0651 VUs  11.0s/30s  5000.00 iters/s
top    [  37% ] 0009/0670 VUs  11.0s/30s  5000.00 iters/s

running (0m12.0s), 0049/1321 VUs, 115586 complete and 0 interrupted iterations
rank   [  40% ] 0026/0651 VUs  12.0s/30s  5000.00 iters/s
top    [  40% ] 0024/0670 VUs  12.0s/30s  5000.00 iters/s

running (0m13.0s), 0035/1321 VUs, 125588 complete and 0 interrupted iterations
rank   [  43% ] 0021/0651 VUs  13.0s/30s  5000.00 iters/s
top    [  43% ] 0015/0670 VUs  13.0s/30s  5000.00 iters/s

running (0m14.0s), 0013/1321 VUs, 135615 complete and 0 interrupted iterations
rank   [  47% ] 0009/0651 VUs  14.0s/30s  5000.00 iters/s
top    [  47% ] 0005/0670 VUs  14.0s/30s  5000.00 iters/s

running (0m15.0s), 0016/1321 VUs, 145619 complete and 0 interrupted iterations
rank   [  50% ] 0008/0651 VUs  15.0s/30s  5000.00 iters/s
top    [  50% ] 0008/0670 VUs  15.0s/30s  5000.00 iters/s

running (0m16.0s), 0017/1321 VUs, 155611 complete and 0 interrupted iterations
rank   [  53% ] 0009/0651 VUs  16.0s/30s  5000.00 iters/s
top    [  53% ] 0009/0670 VUs  16.0s/30s  5000.00 iters/s

running (0m17.0s), 0021/1321 VUs, 165608 complete and 0 interrupted iterations
rank   [  57% ] 0010/0651 VUs  17.0s/30s  5000.00 iters/s
top    [  57% ] 0011/0670 VUs  17.0s/30s  5000.00 iters/s

running (0m18.0s), 0021/1321 VUs, 175608 complete and 0 interrupted iterations
rank   [  60% ] 0011/0651 VUs  18.0s/30s  5000.00 iters/s
top    [  60% ] 0010/0670 VUs  18.0s/30s  5000.00 iters/s

running (0m19.0s), 0038/1321 VUs, 185591 complete and 0 interrupted iterations
rank   [  63% ] 0020/0651 VUs  19.0s/30s  5000.00 iters/s
top    [  63% ] 0020/0670 VUs  19.0s/30s  5000.00 iters/s

running (0m20.0s), 0017/1321 VUs, 195612 complete and 0 interrupted iterations
rank   [  67% ] 0009/0651 VUs  20.0s/30s  5000.00 iters/s
top    [  67% ] 0008/0670 VUs  20.0s/30s  5000.00 iters/s

running (0m21.0s), 0014/1321 VUs, 205615 complete and 0 interrupted iterations
rank   [  70% ] 0007/0651 VUs  21.0s/30s  5000.00 iters/s
top    [  70% ] 0007/0670 VUs  21.0s/30s  5000.00 iters/s

running (0m22.0s), 0017/1321 VUs, 215611 complete and 0 interrupted iterations
rank   [  73% ] 0009/0651 VUs  22.0s/30s  5000.00 iters/s
top    [  73% ] 0008/0670 VUs  22.0s/30s  5000.00 iters/s

running (0m23.0s), 0012/1321 VUs, 225618 complete and 0 interrupted iterations
rank   [  77% ] 0008/0651 VUs  23.0s/30s  5000.00 iters/s
top    [  77% ] 0005/0670 VUs  23.0s/30s  5000.00 iters/s

running (0m24.0s), 0018/1321 VUs, 235611 complete and 0 interrupted iterations
rank   [  80% ] 0007/0651 VUs  24.0s/30s  5000.00 iters/s
top    [  80% ] 0009/0670 VUs  24.0s/30s  5000.00 iters/s

running (0m25.0s), 0019/1321 VUs, 245610 complete and 0 interrupted iterations
rank   [  83% ] 0009/0651 VUs  25.0s/30s  5000.00 iters/s
top    [  83% ] 0010/0670 VUs  25.0s/30s  5000.00 iters/s

running (0m26.0s), 0020/1321 VUs, 255609 complete and 0 interrupted iterations
rank   [  87% ] 0011/0651 VUs  26.0s/30s  5000.00 iters/s
top    [  87% ] 0010/0670 VUs  26.0s/30s  5000.00 iters/s

running (0m27.0s), 0043/1412 VUs, 265210 complete and 0 interrupted iterations
rank   [  90% ] 0020/0696 VUs  27.0s/30s  5000.00 iters/s
top    [  90% ] 0023/0716 VUs  27.0s/30s  5000.00 iters/s

running (0m28.0s), 1312/1470 VUs, 273450 complete and 0 interrupted iterations
rank   [  93% ] 0656/0702 VUs  28.0s/30s  5000.00 iters/s
top    [  93% ] 0658/0768 VUs  28.0s/30s  5000.00 iters/s

running (0m29.0s), 0014/1470 VUs, 284740 complete and 0 interrupted iterations
rank   [  97% ] 0006/0702 VUs  29.0s/30s  5000.00 iters/s
top    [  97% ] 0008/0768 VUs  29.0s/30s  5000.00 iters/s

running (0m30.0s), 0020/1470 VUs, 294740 complete and 0 interrupted iterations
rank   [ 100% ] 0010/0702 VUs  30.0s/30s  5000.00 iters/s
top    [ 100% ] 0010/0768 VUs  30.0s/30s  5000.00 iters/s

     ✗ top 200
      ↳  99% — ✓ 147471 / ✗ 3
     ✗ rank 200/404
      ↳  99% — ✓ 147632 / ✗ 3

     checks.............................: 99.99% 295103 out of 295109
     data_received......................: 904 MB 30 MB/s
     data_sent..........................: 35 MB  1.2 MB/s
     dropped_iterations.................: 4895   163.135089/s
     http_req_blocked...................: avg=37.36µs med=1.5µs   p(95)=5.45µs  p(99)=38.79µs  max=56.91ms 
     http_req_connecting................: avg=32µs    med=0s      p(95)=0s      p(99)=0s       max=34.98ms 
   ✓ http_req_duration..................: avg=12.08ms med=2.09ms  p(95)=83.61ms p(99)=159.85ms max=278.44ms
       { expected_response:true }.......: avg=12.08ms med=2.09ms  p(95)=83.61ms p(99)=159.85ms max=278.44ms
     ✓ { name:GET /leaderboard/rank }...: avg=12.18ms med=2.15ms  p(95)=84.21ms p(99)=158.56ms max=276.04ms
     ✓ { name:GET /leaderboard/top }....: avg=11.99ms med=2.03ms  p(95)=83.03ms p(99)=160.61ms max=278.44ms
     ✓ { name:POST /score }.............: avg=0s      med=0s      p(95)=0s      p(99)=0s       max=0s      
   ✓ http_req_failed....................: 0.00%  6 out of 295109
     http_req_receiving.................: avg=26.35µs med=12.91µs p(95)=77.66µs p(99)=190.5µs  max=44.31ms 
     http_req_sending...................: avg=41.85µs med=3.45µs  p(95)=64.54µs p(99)=332.45µs max=74.55ms 
     http_req_tls_handshaking...........: avg=0s      med=0s      p(95)=0s      p(99)=0s       max=0s      
     http_req_waiting...................: avg=12.02ms med=2.06ms  p(95)=83.49ms p(99)=158.87ms max=278.41ms
     http_reqs..........................: 295109 9835.062926/s
     iteration_duration.................: avg=12.19ms med=2.14ms  p(95)=84.07ms p(99)=165.24ms max=279.45ms
     iterations.........................: 295109 9835.062926/s
     vus................................: 20     min=12               max=1312
     vus_max............................: 1470   min=1304             max=1470


running (0m30.0s), 0000/1470 VUs, 295109 complete and 0 interrupted iterations
rank ✓ [ 100% ] 0000/0702 VUs  30s  5000.00 iters/s
top  ✓ [ 100% ] 0000/0768 VUs  30s  5000.00 iters/s